import SearchPage, {  OneSearchProduct, SearchPagePropType } from '../../components/pages/SearchPage';


const fakeData: SearchPagePropType = {
  data: [
    {  
      id: '1',
      title: 'Стиральная машина Bosch',
      about: 'Стиральная машина Bosch хорошая очень хорошая очень хорошая очень хорошая очень хорошая очень хорошая очень хорошая очень хорошая очень хорошая очень хорошая',
      date: '12 мая 2015',
    },
    {  
      id: '2',
      title: 'Стиральная машина Bosch',
      about: 'Стиральная машина Bosch хорошая очень хорошая',
      date: '12 мая 2015',
    },
    {  
      id: '3',
      title: 'Стиральная машина Bosch',
      about: 'Стиральная машина Bosch хорошая очень хорошая',
      date: '12 мая 2015',
    },
    {  
      id: '4',
      title: 'Стиральная машина Bosch',
      about: 'Стиральная машина Bosch хорошая очень хорошая',
      date: '12 мая 2015',
    },
    {  
      id: '5',
      title: 'Стиральная машина Bosch',
      about: 'Стиральная машина Bosch хорошая очень хорошая',
      date: '12 мая 2015',
    },
    {  
      id: '6',
      title: 'Стиральная машина Bosch',
      about: 'Стиральная машина Bosch хорошая очень хорошая',
      date: '12 мая 2015',
    },
    {  
      id: '7',
      title: 'Стиральная машина Bosch',
      about: 'Стиральная машина Bosch хорошая очень хорошая',
      date: '12 мая 2015',
    },
    {  
      id: '8',
      title: 'Стиральная машина Bosch',
      about: 'Стиральная машина Bosch хорошая очень хорошая',
      date: '12 мая 2015',
    },
    {  
      id: '9',
      title: 'Стиральная машина Bosch',
      about: 'Стиральная машина Bosch хорошая очень хорошая',
      date: '12 мая 2015',
    },
    {  
      id: '10',
      title: 'Стиральная машина Bosch',
      about: 'Стиральная машина Bosch хорошая очень хорошая',
      date: '12 мая 2015',
    },
    {  
      id: '11',
      title: 'Стиральная машина Bosch',
      about: 'Стиральная машина Bosch хорошая очень хорошая',
      date: '12 мая 2015',
    },
  ],
  count: 26,
}

export default fakeData;